In [1]:
import numpy as np

import pandas as pd

from pandas import Series, DataFrame

In [2]:
ser1 =Series ([2,np.nan,4,6,np.nan,8,np.nan,10], index= ['N','G','R','E','Z','C','G','K'])
ser1

N     2.0
G     NaN
R     4.0
E     6.0
Z     NaN
C     8.0
G     NaN
K    10.0
dtype: float64

In [3]:
ser2 = Series(np.arange(len(ser1)), dtype = np.float64, index = ['N','G','R','E','Z','C','G','K'])
ser2

N    0.0
G    1.0
R    2.0
E    3.0
Z    4.0
C    5.0
G    6.0
K    7.0
dtype: float64

In [4]:
# im trying to pass a conditional statement per se that if ser1 contains null value , it should be filled up with a ser2 value or 
# should be filled with a ser1 value

In [5]:
Series(np.where(pd.isnull(ser1),ser2,ser1), index = ser1.index)

N     2.0
G     1.0
R     4.0
E     6.0
Z     4.0
C     8.0
G     6.0
K    10.0
dtype: float64

we can redo  this with calling the combine function but it doesn't seem to work on my ntbk.

In [6]:
nan = np.nan

In [8]:
OddDframe = DataFrame({'X':[1.,nan,3.,nan],
                      'Y':[5.,nan,7.,nan],
                      'Z':[9.,nan,11,nan]} )

In [9]:
EvenDframe = DataFrame({'X':[2.,4,nan,6.,8.],
                      'Y':[nan,10.,12.,14.,16.]})

In [11]:
OddDframe

     X    Y     Z
0  1.0  NaN   7.0
1  NaN  5.0   NaN
2  3.0  NaN  11.0

In [12]:
EvenDframe

     X     Y
0  2.0   NaN
1  4.0  10.0
2  NaN  12.0
3  6.0  14.0
4  8.0  16.0

In [13]:
OddDframe.combine_first(EvenDframe)

     X     Y     Z
0  1.0   NaN   7.0
1  4.0   5.0   NaN
2  3.0  12.0  11.0
3  6.0  14.0   NaN
4  8.0  16.0   NaN

In [14]:
dframe4 = DataFrame(np.arange(8).reshape(2,4),
                   index = pd.Index(['Mon','Tue'], name = 'Days'),
                   columns = pd.Index(['mct331','eee351','mct342','mct311'],name = 'course'))
dframe4

course  mct331  eee351  mct342  mct311
Days
Mon          0       1       2       3
Tue          4       5       6       7

In [15]:
# to stack the columns into becoming index we use the stack()

In [16]:
dframe_st = dframe4.stack()
dframe_st

Days  course
Mon   mct331    0
      eee351    1
      mct342    2
      mct311    3
Tue   mct331    4
      eee351    5
      mct342    6
      mct311    7
dtype: int32

  to turn back into a DataFrame we use unstack()

In [17]:
dframe_st.unstack()

course  mct331  eee351  mct342  mct311
Days
Mon          0       1       2       3
Tue          4       5       6       7

In [18]:
dframe_st.unstack('Days')

Days    Mon  Tue
course
mct331    0    4
eee351    1    5
mct342    2    6
mct311    3    7

In [19]:
ser4 = Series(['A','A','A'], index =['mct342','mct311','mct331'])
ser5 = Series(['A','A','A'], index =['ece371','mct301','mct302'])

In [20]:
dframe6 = pd.concat([ser4,ser5],keys= ['very good','excellent'])
dframe6

very good  mct342    A
           mct311    A
           mct331    A
excellent  ece371    A
           mct301    A
           mct302    A
dtype: object

In [21]:
dframe6.unstack()

          ece371 mct301 mct302 mct311 mct331 mct342
very good    NaN    NaN    NaN      A      A      A
excellent      A      A      A    NaN    NaN    NaN

In [24]:
dframe6.unstack().stack()

very good  mct311    A
           mct331    A
           mct342    A
excellent  ece371    A
           mct301    A
           mct302    A
dtype: object